benchmark/go-frameworks/results/20260924-102750/results/post/echo/r1/20000.txt
Running 40s test @ http://10.128.0.4:8084/api/devices
  16 threads and 512 connections
  Thread calibration: mean lat.: 0.932ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.924ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.932ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.059ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.924ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.923ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.912ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.934ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.929ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.922ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.938ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.919ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.915ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.974ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.922ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.916ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.92ms  454.89us   7.64ms   69.37%
    Req/Sec     1.33k   392.52     3.56k    80.10%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.90ms
 75.000%    1.21ms
 90.000%    1.46ms
 99.000%    2.05ms
 99.900%    3.83ms
 99.990%    5.24ms
 99.999%    6.36ms
100.000%    7.64ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.098     0.000000            1         1.00
       0.354     0.100000        59900         1.11
       0.508     0.200000       119360         1.25
       0.648     0.300000       179302         1.43
       0.778     0.400000       238826         1.67
       0.905     0.500000       298506         2.00
       0.968     0.550000       328508         2.22
       1.029     0.600000       358549         2.50
       1.088     0.650000       388335         2.86
       1.147     0.700000       417791         3.33
       1.208     0.750000       447858         4.00
       1.241     0.775000       462832         4.44
       1.276     0.800000       477687         5.00
       1.312     0.825000       492490         5.71
       1.351     0.850000       507333         6.67
       1.399     0.875000       522398         8.00
       1.427     0.887500       529662         8.89
       1.460     0.900000       537169        10.00
       1.497     0.912500       544742        11.43
       1.539     0.925000       552199        13.33
       1.587     0.937500       559529        16.00
       1.614     0.943750       563336        17.78
       1.644     0.950000       567053        20.00
       1.678     0.956250       570785        22.86
       1.717     0.962500       574460        26.67
       1.762     0.968750       578175        32.00
       1.787     0.971875       580049        35.56
       1.815     0.975000       581910        40.00
       1.847     0.978125       583772        45.71
       1.883     0.981250       585643        53.33
       1.928     0.984375       587503        64.00
       1.954     0.985938       588411        71.11
       1.985     0.987500       589346        80.00
       2.022     0.989062       590285        91.43
       2.075     0.990625       591225       106.67
       2.165     0.992188       592141       128.00
       2.237     0.992969       592606       142.22
       2.339     0.993750       593070       160.00
       2.459     0.994531       593537       182.86
       2.597     0.995313       594004       213.33
       2.751     0.996094       594467       256.00
       2.837     0.996484       594699       284.44
       2.945     0.996875       594934       320.00
       3.053     0.997266       595166       365.71
       3.185     0.997656       595405       426.67
       3.343     0.998047       595632       512.00
       3.435     0.998242       595749       568.89
       3.517     0.998437       595867       640.00
       3.601     0.998633       595984       731.43
       3.699     0.998828       596101       853.33
       3.849     0.999023       596218      1024.00
       3.919     0.999121       596273      1137.78
       4.001     0.999219       596331      1280.00
       4.095     0.999316       596390      1462.86
       4.247     0.999414       596448      1706.67
       4.387     0.999512       596507      2048.00
       4.475     0.999561       596535      2275.56
       4.567     0.999609       596566      2560.00
       4.651     0.999658       596595      2925.71
       4.763     0.999707       596623      3413.33
       4.875     0.999756       596652      4096.00
       4.919     0.999780       596666      4551.11
       4.971     0.999805       596682      5120.00
       5.035     0.999829       596696      5851.43
       5.091     0.999854       596711      6826.67
       5.155     0.999878       596726      8192.00
       5.203     0.999890       596732      9102.22
       5.259     0.999902       596739     10240.00
       5.379     0.999915       596749     11702.86
       5.431     0.999927       596755     13653.33
       5.503     0.999939       596761     16384.00
       5.531     0.999945       596765     18204.44
       5.551     0.999951       596768     20480.00
       5.643     0.999957       596772     23405.71
       5.739     0.999963       596776     27306.67
       5.899     0.999969       596779     32768.00
       5.915     0.999973       596781     36408.89
       6.003     0.999976       596783     40960.00
       6.079     0.999979       596785     46811.43
       6.195     0.999982       596787     54613.33
       6.239     0.999985       596788     65536.00
       6.255     0.999986       596789     72817.78
       6.271     0.999988       596790     81920.00
       6.359     0.999989       596791     93622.86
       6.431     0.999991       596792    109226.67
       6.459     0.999992       596793    131072.00
       6.459     0.999993       596793    145635.56
       6.643     0.999994       596794    163840.00
       6.643     0.999995       596794    187245.71
       6.923     0.999995       596795    218453.33
       6.923     0.999996       596795    262144.00
       6.923     0.999997       596795    291271.11
       7.095     0.999997       596796    327680.00
       7.095     0.999997       596796    374491.43
       7.095     0.999998       596796    436906.67
       7.095     0.999998       596796    524288.00
       7.095     0.999998       596796    582542.22
       7.639     0.999998       596797    655360.00
       7.639     1.000000       596797          inf
#[Mean    =        0.921, StdDeviation   =        0.455]
#[Max     =        7.636, Total count    =       596797]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  797482 requests in 40.00s, 130.38MB read
Requests/sec:  19934.60
Transfer/sec:      3.26MB