benchmark/go-frameworks/results/20260924-102750/results/post/echo/r1/40000.txt
Running 40s test @ http://10.128.0.4:8084/api/devices
  16 threads and 512 connections
  Thread calibration: mean lat.: 1.051ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.059ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.056ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.047ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.051ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.052ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.049ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.045ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.046ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.043ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.046ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.064ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.036ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.048ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.058ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.063ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.00ms  536.67us  13.30ms   73.88%
    Req/Sec     2.62k   204.56     3.90k    69.61%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.97ms
 75.000%    1.30ms
 90.000%    1.59ms
 99.000%    2.83ms
 99.900%    4.55ms
 99.990%    7.38ms
 99.999%   11.63ms
100.000%   13.31ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.097     0.000000            1         1.00
       0.384     0.100000       119438         1.11
       0.552     0.200000       238765         1.25
       0.699     0.300000       358598         1.43
       0.835     0.400000       478070         1.67
       0.966     0.500000       597103         2.00
       1.032     0.550000       657337         2.22
       1.096     0.600000       716138         2.50
       1.162     0.650000       776143         2.86
       1.228     0.700000       835756         3.33
       1.296     0.750000       895645         4.00
       1.330     0.775000       925182         4.44
       1.366     0.800000       955086         5.00
       1.406     0.825000       985091         5.71
       1.453     0.850000      1014842         6.67
       1.512     0.875000      1044585         8.00
       1.547     0.887500      1059435         8.89
       1.586     0.900000      1074270        10.00
       1.631     0.912500      1089407        11.43
       1.682     0.925000      1104172        13.33
       1.742     0.937500      1119014        16.00
       1.776     0.943750      1126427        17.78
       1.816     0.950000      1133952        20.00
       1.862     0.956250      1141346        22.86
       1.917     0.962500      1148776        26.67
       1.995     0.968750      1156282        32.00
       2.045     0.971875      1160024        35.56
       2.109     0.975000      1163709        40.00
       2.197     0.978125      1167439        45.71
       2.319     0.981250      1171196        53.33
       2.469     0.984375      1174889        64.00
       2.559     0.985938      1176745        71.11
       2.649     0.987500      1178618        80.00
       2.757     0.989062      1180480        91.43
       2.879     0.990625      1182342       106.67
       3.015     0.992188      1184202       128.00
       3.091     0.992969      1185131       142.22
       3.177     0.993750      1186070       160.00
       3.269     0.994531      1186994       182.86
       3.373     0.995313      1187935       213.33
       3.501     0.996094      1188861       256.00
       3.579     0.996484      1189324       284.44
       3.659     0.996875      1189789       320.00
       3.755     0.997266      1190254       365.71
       3.861     0.997656      1190721       426.67
       3.985     0.998047      1191186       512.00
       4.069     0.998242      1191423       568.89
       4.163     0.998437      1191658       640.00
       4.279     0.998633      1191887       731.43
       4.415     0.998828      1192124       853.33
       4.587     0.999023      1192360      1024.00
       4.691     0.999121      1192472      1137.78
       4.807     0.999219      1192585      1280.00
       4.923     0.999316      1192702      1462.86
       5.059     0.999414      1192819      1706.67
       5.239     0.999512      1192935      2048.00
       5.395     0.999561      1192994      2275.56
       5.535     0.999609      1193051      2560.00
       5.675     0.999658      1193110      2925.71
       5.875     0.999707      1193170      3413.33
       6.111     0.999756      1193226      4096.00
       6.271     0.999780      1193255      4551.11
       6.515     0.999805      1193284      5120.00
       6.751     0.999829      1193314      5851.43
       7.007     0.999854      1193344      6826.67
       7.199     0.999878      1193372      8192.00
       7.295     0.999890      1193387      9102.22
       7.427     0.999902      1193401     10240.00
       7.583     0.999915      1193417     11702.86
       7.755     0.999927      1193430     13653.33
       8.215     0.999939      1193445     16384.00
       9.023     0.999945      1193452     18204.44
       9.687     0.999951      1193459     20480.00
      10.047     0.999957      1193467     23405.71
      10.263     0.999963      1193474     27306.67
      10.519     0.999969      1193481     32768.00
      10.775     0.999973      1193485     36408.89
      10.847     0.999976      1193488     40960.00
      11.023     0.999979      1193492     46811.43
      11.199     0.999982      1193496     54613.33
      11.303     0.999985      1193499     65536.00
      11.375     0.999986      1193501     72817.78
      11.407     0.999988      1193503     81920.00
      11.631     0.999989      1193505     93622.86
      11.839     0.999991      1193507    109226.67
      11.871     0.999992      1193508    131072.00
      11.935     0.999993      1193509    145635.56
      11.983     0.999994      1193510    163840.00
      12.183     0.999995      1193511    187245.71
      12.359     0.999995      1193512    218453.33
      12.447     0.999996      1193513    262144.00
      12.447     0.999997      1193513    291271.11
      12.759     0.999997      1193514    327680.00
      12.759     0.999997      1193514    374491.43
      13.039     0.999998      1193515    436906.67
      13.039     0.999998      1193515    524288.00
      13.039     0.999998      1193515    582542.22
      13.063     0.999998      1193516    655360.00
      13.063     0.999999      1193516    748982.86
      13.063     0.999999      1193516    873813.33
      13.063     0.999999      1193516   1048576.00
      13.063     0.999999      1193516   1165084.44
      13.311     0.999999      1193517   1310720.00
      13.311     1.000000      1193517          inf
#[Mean    =        1.004, StdDeviation   =        0.537]
#[Max     =       13.304, Total count    =      1193517]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1597030 requests in 40.00s, 261.96MB read
Requests/sec:  39928.71
Transfer/sec:      6.55MB